a={}
for i in range(int(input())):
    b,c=map(str,input().split(':'))
    a[b.lower()]=c.strip()
for i in range(int(input())):
    print(a.get(input().lower(),'Не найдено'))

# 7
# Бэкенд: программно-аппаратная или серверная часть приложения
# Бэкап: резервная копия или процесс создания резервной копии приложения
# Галера: компания, в которой платят низкие зарплаты и не ценят разработчиков
# Гит: система контроля версий Git или сервис GitHub
# Г***окод: плохой, некачественный код
# Жаба: язык программирования Java
# Жабаскрипт: язык программирования JavaScript
# 6
# Жаба
# Змея
# Костыль
# Бета
# БЭКЕНД
# Г***окод